In [61]:
try:
    import sqlite3 as sql 
    import pandas as pd 
    print("imported successfully")
except ModuleNotFoundError:
    print("please install madule ")

imported successfully

In [62]:
# 1. Connect to the database (Creates the file automatically)
conn=sql.connect("dubai_housing.db")

# 2. Load your CLEANED data
# Make sure 'cleaned_dubai_data.csv' is in the same folder!
df=pd.read_csv("cleaned_dubai_data.csv")

# 3. Save it to SQL (This creates the table 'transactions')
df.to_sql("transactions",conn,if_exists="replace",index=False)
print("Database created and data loaded successfully!")

Database created and data loaded successfully!

In [63]:
# QUERY 1: Top 10 most popular areas in Dubai based on the number of sales.
query_1 = """
SELECT
    area_name,
    count(*) as total_transaction,
    round(avg(actual_worth),0) as avg_price,
    round(avg(actual_worth / area),0) as price_per_sqft
FROM transactions
GROUP BY area_name
ORDER BY total_transaction desc
LIMIT 10

"""

df_q1 = pd.read_sql(query_1, conn)
display(df_q1) # Use print(df_q1) if you are not in Jupyter

,area_name,total_transaction,avg_price,price_per_sqft
0,Business Bay,13432,1411572.0,18605.0
1,Marsa Dubai,10625,2023323.0,23575.0
2,Al Barsha South Fourth,9547,767113.0,10416.0
3,Burj Khalifa,6300,2375859.0,23030.0
4,Al Merkadh,5893,1350074.0,18097.0
5,Al Khairan First,5364,2102449.0,19363.0
6,Wadi Al Safa 5,5179,1371881.0,9090.0
7,Al Hebiah Fifth,5012,1935331.0,11772.0
8,Jabal Ali First,4762,1097437.0,9537.0
9,Hadaeq Sheikh Mohammed Bin Rashid,4525,1719285.0,16308.0

"Business Bay offers the highest market liquidity in Dubai.
Mitigating exit risk for short-term investors."

**which type of property is the most expensive per square metter: Villas, Units (Apartments), or Land.**

In [64]:
query_2="""
    SELECT 
    property_type,
    count(*) as total_sale,
    round(avg(actual_worth),0) as avg_price,
    round(avg(actual_worth / area )) as price_per_sqft
FROM transactions
where property_type in ("Villa","Unit","Land")
GROUP BY property_type
ORDER by price_per_sqft desc;
"""
df_q2=pd.read_sql(query_2,conn)
display(df_q2)

  property_type  total_sale  avg_price  price_per_sqft
0          Unit       98638  1403331.0         15833.0
1          Land        7227  1998267.0         11273.0
2         Villa       15174  1981838.0          9992.0

**which apartment size is selling the most volume: Studios, 1-Bedrooms, or 2-Bedrooms.**

In [65]:
query_3="""
    SELECT 
        rooms,
        count(*) as total_sale,
        round(avg(actual_worth),0) as avg_price
    FROM transactions 
    WHERE rooms IN (0,1,2,3)
    GROUP BY rooms
    ORDER BY total_sale DESC;
"""
df_q3=pd.read_sql(query_3,conn)
display(df_q3)

   rooms  total_sale  avg_price
0    1.0       40160  1130652.0
1    0.0       30362  1033235.0
2    2.0       28733  1927882.0
3    3.0       15651  2286247.0

In [66]:


# ---------------------------------------------------------
# EXPORT DATA FOR POWER BI (PHASE 3)
# ---------------------------------------------------------
df_q1.to_csv('sql_top_areas.csv', index=False)
df_q2.to_csv('sql_property_types.csv', index=False)
df_q3.to_csv('sql_room_types.csv', index=False)
print("\n✅ SQL Analysis complete. CSV files exported for Power BI.")

✅ SQL Analysis complete. CSV files exported for Power BI.